#include "main.h"

/***************************************************************************************************/
/* возвращает запрашивает номер кабинета и название здания                                         */
/***************************************************************************************************/


bool TInventory::get_other()
{


  std::cout << "Введите кабинет: "<< std::flush;;
  getline( std::cin, id_office );

  //cin.ignore(); // очищаем буфер от символа \n после ввода числа

  std::cout << "Введите здание: "<< std::flush;;
  getline( std::cin, id_structure );

  //cout << "Имя: " << full_name << ", возраст: " << age << endl;
  return true;

}
